thumbnail_microservices/load-test.yaml
config:
  target: "http://34.76.114.254"  # fixed target!
  phases:
    - duration: 60  # Run for 1 minute
      arrivalRate: 30  # 100 new virtual users per second
  http:
    timeout: 60  # <-- New! Wait up to 60 seconds for server responses

scenarios:
  - name: "Upload Image from Local Drive"
    flow:
      - post:
          url: "/upload"
          headers:
            Accept: "application/json"
          formData:
            user: "testuser"
            image: "C:/Users/pooja/Downloads/procedures.png"  # Specify the file directly
          expect:
            - statusCode: 200