thumbnail_microservices/load-test.yaml
config:
  target: "http://34.76.114.254"  # fixed target!
  phases:
    - duration: 60  # Run for 5 minutes
      arrivalRate: 100  # 1 new virtual user per second
 
scenarios:
  - name: "Upload Image from Local Drive"
    flow:
      - post:
          url: "/upload"
          headers:
            Accept: "application/json"
          formData:
            user: "testuser"
            image: "C:/Benutzer/User/Downloads/Kubernetes.png"  # Specify the file directly
          expect:
            - statusCode: 200